arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/m8q/m8q.cpp
#include "m8q.hpp"
#include "bsp.hpp"
#include "gpio.hpp"
#include "nrf_delay.h"
#include "rtc.hpp"
#include "error.hpp"

extern RTC *rtc;

using namespace UBX;

template <typename T>
M8QReceiver::SendReturnCode M8QReceiver::send_packet_contents(UBX::MessageClass msgClass, uint8_t id, T contents, bool expect_ack)
{
    const std::time_t timeout = 3;

    // Construct packet header
    UBX::Header header = {
        .syncChars = {UBX::SYNC_CHAR1, UBX::SYNC_CHAR2},
        .msgClass = msgClass,
        .msgId = id,
        .msgLength = sizeof(contents)
    };

    // Calculate the checksum
    uint8_t ck[2] = {0};
    uint8_t *checksum_ptr = reinterpret_cast<uint8_t *>(&header.msgClass);

    // Calculate the checksum across the msgClass, msgId and msgLength
    for (unsigned int i = 0; i < 4; i++)
    {
        ck[0] = ck[0] + checksum_ptr[i];
        ck[1] = ck[1] + ck[0];
    }

    // Calculate the checksum across the contents
    checksum_ptr = reinterpret_cast<uint8_t *>(&contents);
    for (unsigned int i = 0; i < sizeof(contents); i++)
    {
        ck[0] = ck[0] + checksum_ptr[i];
        ck[1] = ck[1] + ck[0];
    }

    m_rx_buffer.pending = false;
    m_nrf_uart_m8->send(reinterpret_cast<uint8_t *>(&header), sizeof(header));
    m_nrf_uart_m8->send(reinterpret_cast<uint8_t *>(&contents), sizeof(contents));
    m_nrf_uart_m8->send(&ck[0], sizeof(ck));

    // Wait for an ACK/NACK if we are expecting one
    if (expect_ack)
    {
        auto start_time = rtc->gettime();
        for (;;)
        {
            if (m_rx_buffer.pending)
            {
                UBX::Header *header_ptr = reinterpret_cast<UBX::Header *>(&m_rx_buffer.data[0]);
                if (header_ptr->msgClass == UBX::MessageClass::MSG_CLASS_ACK)
                {
                    if (header_ptr->msgId == UBX::ACK::ID_ACK)
                    {
                        UBX::ACK::MSG_ACK *msg_ack_ptr = reinterpret_cast<UBX::ACK::MSG_ACK *>(&m_rx_buffer.data[sizeof(UBX::Header)]);
                        if (msg_ack_ptr->clsID == msgClass && msg_ack_ptr->msgID == id)
                        {
                            //DEBUG_TRACE("GPS ACK-ACK <-");
                            return SendReturnCode::SUCCESS;
                        }
                    }
                    else if (header_ptr->msgId == UBX::ACK::ID_NACK)
                    {
                        UBX::ACK::MSG_ACK *msg_nack_ptr = reinterpret_cast<UBX::ACK::MSG_ACK *>(&m_rx_buffer.data[sizeof(UBX::Header)]);
                        if (msg_nack_ptr->clsID == msgClass && msg_nack_ptr->msgID == id)
                        {
                            DEBUG_WARN("GPS ACK-NACK <-");
                            return SendReturnCode::NACKD;
                        }
                    }
                }

                m_rx_buffer.pending = false;
            }

            if (rtc->gettime() - start_time >= timeout)
            {
                DEBUG_ERROR("GPS Timed out waiting for response");
                return SendReturnCode::RESPONSE_TIMEOUT;
            }
        }
    }

    return SendReturnCode::SUCCESS;
}

template <typename T>
M8QReceiver::SendReturnCode M8QReceiver::poll_contents_and_collect(UBX::MessageClass msgClass, uint8_t id, T &contents)
{
    const std::time_t timeout = 3;

    // Construct packet header
    UBX::Header header = {
        .syncChars = {UBX::SYNC_CHAR1, UBX::SYNC_CHAR2},
        .msgClass = msgClass,
        .msgId = id,
        .msgLength = 0
    };

    // Calculate the checksum
    uint8_t ck[2] = {0};
    uint8_t *checksum_ptr = reinterpret_cast<uint8_t *>(&header.msgClass);

    // Calculate the checksum across the msgClass, msgId and msgLength
    for (unsigned int i = 0; i < 4; i++)
    {
        ck[0] = ck[0] + checksum_ptr[i];
        ck[1] = ck[1] + ck[0];
    }

    m_rx_buffer.pending = false;
    m_nrf_uart_m8->send(reinterpret_cast<uint8_t *>(&header), sizeof(header));
    m_nrf_uart_m8->send(&ck[0], sizeof(ck));

    // Wait for the poll response
    auto start_time = rtc->gettime();
    for (;;)
    {
        if (m_rx_buffer.pending)
        {
            UBX::Header *header_ptr = reinterpret_cast<UBX::Header *>(&m_rx_buffer.data[0]);
            if (header_ptr->msgClass == msgClass && header_ptr->msgId == id)
            {
                if (m_rx_buffer.len == sizeof(T) + sizeof(UBX::Header) + sizeof(ck))
                {
                    memcpy(&contents, &m_rx_buffer.data[sizeof(UBX::Header)], sizeof(T));
                    return SendReturnCode::SUCCESS;
                }
            }

            m_rx_buffer.pending = false;
        }

        if (rtc->gettime() - start_time >= timeout)
        {
            DEBUG_ERROR("GPS Timed out waiting for response");
            return SendReturnCode::RESPONSE_TIMEOUT;
        }
    }

    return SendReturnCode::SUCCESS;
}

M8QReceiver::SendReturnCode M8QReceiver::poll_contents(UBX::MessageClass msgClass, uint8_t id)
{
    // Construct packet header
    UBX::Header header = {
        .syncChars = {UBX::SYNC_CHAR1, UBX::SYNC_CHAR2},
        .msgClass = msgClass,
        .msgId = id,
        .msgLength = 0
    };

    // Calculate the checksum
    uint8_t ck[2] = {0};
    uint8_t *checksum_ptr = reinterpret_cast<uint8_t *>(&header.msgClass);

    // Calculate the checksum across the msgClass, msgId and msgLength
    for (unsigned int i = 0; i < 4; i++)
    {
        ck[0] = ck[0] + checksum_ptr[i];
        ck[1] = ck[1] + ck[0];
    }

    m_nrf_uart_m8->send(reinterpret_cast<uint8_t *>(&header), sizeof(header));
    m_nrf_uart_m8->send(&ck[0], sizeof(ck));

    return SendReturnCode::SUCCESS;
}

M8QReceiver::M8QReceiver()
{
    m_nrf_uart_m8 = nullptr;
    m_navigation_database_len = 0;
    m_rx_buffer.pending = false;
    m_capture_messages = false;
    m_state = State::POWERED_OFF;
}

M8QReceiver::~M8QReceiver()
{
    delete m_nrf_uart_m8;
    GPIOPins::clear(BSP::GPIO::GPIO_GPS_PWR_EN); // Ensure the GPS is hard shutdown
}

void M8QReceiver::power_off()
{
    if (m_state == State::POWERED_OFF)
        return;
    
    m_state = State::POWERED_OFF;

    DEBUG_INFO("M8QReceiver::power_off");

    m_capture_messages = true;

    // Disable any messages so they don't interrupt our navigation database dump
    disable_nav_pvt_message();
    disable_nav_dop_message();

    fetch_navigation_database();

    delete m_nrf_uart_m8;
    m_nrf_uart_m8 = nullptr; // Invalidate this pointer so if we call this function again it doesn't call delete on an invalid pointer

    // Disable the power supply for the GPS
    GPIOPins::clear(BSP::GPIO::GPIO_GPS_PWR_EN);

    m_rx_buffer.pending = false;
    m_data_notification_callback = nullptr;
}

M8QReceiver::SendReturnCode M8QReceiver::print_version()
{
    // Request the receiver and software version
    poll_contents(UBX::MessageClass::MSG_CLASS_MON, UBX::MON::ID_VER);

    auto start_time = rtc->gettime();
    const std::time_t timeout = 3;
    
    for (;;)
    {
        if (m_rx_buffer.pending)
        {
            UBX::Header *header_ptr = reinterpret_cast<UBX::Header *>(&m_rx_buffer.data[0]);
            if (header_ptr->msgClass == UBX::MessageClass::MSG_CLASS_MON && header_ptr->msgId == UBX::MON::ID_VER)
            {
                uint8_t *data_ptr = &m_rx_buffer.data[sizeof(UBX::Header)];
                DEBUG_TRACE("M8QReceiver::print_version");
                DEBUG_TRACE("%.*s", 30, &data_ptr[0]);  // swVersion
                DEBUG_TRACE("%.*s", 10, &data_ptr[30]); // hwVersion
                uint32_t number_of_extensions = (header_ptr->msgLength - 40) / 30;
                for (uint32_t i = 0; i < number_of_extensions; ++i)
                {
                    DEBUG_TRACE("%.*s", 30, &data_ptr[40 + (i * 30)]); // Extension
                }
                return SendReturnCode::SUCCESS;
            }

            m_rx_buffer.pending = false;
        }

        if (rtc->gettime() - start_time >= timeout)
        {
            DEBUG_ERROR("M8QReceiver::print_version: timed out waiting for response");
            m_navigation_database_len = 0; // Invalidate the data we did receive
            return SendReturnCode::RESPONSE_TIMEOUT;
        }
    }

    return SendReturnCode::SUCCESS;
}

M8QReceiver::SendReturnCode M8QReceiver::fetch_navigation_database()
{
    const std::time_t timeout = 3;
    uint8_t *write_dst = &m_navigation_database[0];
    m_navigation_database_len = 0;
    uint32_t number_of_mga_dbd_msgs = 0;

    m_capture_messages = true;

