arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/m8q/m8q.cpp
    m_capture_messages = false;

    return;

POWER_ON_FAILURE:

    // Our power on has failed so ensure we leave the GPS powered down
    power_off();

    if (ret == SendReturnCode::NACKD)
        throw ErrorCode::GPS_BOOT_NACKED;
    else if (ret == SendReturnCode::RESPONSE_TIMEOUT)
        throw ErrorCode::GPS_BOOT_TIMEOUT;
    else
        throw;
}

void M8QReceiver::reception_callback(uint8_t *data, size_t len)
{
    // If we haven't booted then we need to stash the incoming messages so that we can check for ACK/NACKs whilst configuring the device
    if (m_capture_messages)
    {
        if (!m_rx_buffer.pending)
        {
            memcpy(&m_rx_buffer.data[0], data, len);
            m_rx_buffer.pending = true;
            m_rx_buffer.len = len;
        }

        m_rx_buffer.pending = true;
    }
    else
    {
        // We're looking for a pair of NAV-PVT and NAV-DOP messages so we can retrieve all the data necessary to generate a callback
        // We can use iTow to ensure both messages relate to the same position/time
        UBX::Header *header_ptr = reinterpret_cast<UBX::Header *>(&data[0]);
        if (header_ptr->msgClass == UBX::MessageClass::MSG_CLASS_NAV)
        {
            if (header_ptr->msgId == UBX::NAV::ID_PVT)
            {
                UBX::NAV::PVT::MSG_PVT *msg_pvt_ptr = reinterpret_cast<UBX::NAV::PVT::MSG_PVT *>(&data[sizeof(UBX::Header)]);
                memcpy(&m_last_received_pvt, msg_pvt_ptr, sizeof(m_last_received_pvt));

                //DEBUG_TRACE("GPS NAV-PVT <-");

                populate_gnss_data_and_callback();
            }
            else if (header_ptr->msgId == UBX::NAV::ID_DOP)
            {
                UBX::NAV::DOP::MSG_DOP *msg_dop_ptr = reinterpret_cast<UBX::NAV::DOP::MSG_DOP *>(&data[sizeof(UBX::Header)]);
                memcpy(&m_last_received_dop, msg_dop_ptr, sizeof(m_last_received_dop));

                //DEBUG_TRACE("GPS NAV-DOP <-");

                populate_gnss_data_and_callback();
            }
        }
    }
}

// Checks if the data we have to date is enough to generate a gnss data callback and if it is calls it
void M8QReceiver::populate_gnss_data_and_callback()
{
    if (m_last_received_pvt.fixType != UBX::NAV::PVT::FIXTYPE_NO &&    // GPS Fix must be achieved
        m_last_received_pvt.valid & UBX::NAV::PVT::VALID_VALID_DATE && // Date must be valid
        m_last_received_pvt.valid & UBX::NAV::PVT::VALID_VALID_TIME && // Time must be valid
        m_last_received_pvt.iTow == m_last_received_dop.iTow)          // Both received DOP and NAV must refer to the same position
    {
        GNSSData gnss_data = 
        {
            .iTOW      = m_last_received_pvt.iTow,
            .year      = m_last_received_pvt.year,
            .month     = m_last_received_pvt.month,
            .day       = m_last_received_pvt.day,
            .hour      = m_last_received_pvt.hour,
            .min       = m_last_received_pvt.min,
            .sec       = m_last_received_pvt.sec,
            .valid     = m_last_received_pvt.valid,
            .tAcc      = m_last_received_pvt.tAcc,
            .nano      = m_last_received_pvt.nano,
            .fixType   = m_last_received_pvt.fixType,
            .flags     = m_last_received_pvt.flags,
            .flags2    = m_last_received_pvt.flags2,
            .flags3    = m_last_received_pvt.flags3,
            .numSV     = m_last_received_pvt.numSV,
            .lon       = m_last_received_pvt.lon / 10000000.0,
            .lat       = m_last_received_pvt.lat / 10000000.0,
            .height    = m_last_received_pvt.height,
            .hMSL      = m_last_received_pvt.hMSL,
            .hAcc      = m_last_received_pvt.hAcc,
            .vAcc      = m_last_received_pvt.vAcc,
            .velN      = m_last_received_pvt.velN,
            .velE      = m_last_received_pvt.velE,
            .velD      = m_last_received_pvt.velD,
            .gSpeed    = m_last_received_pvt.gSpeed,
            .headMot   = m_last_received_pvt.headMot / 100000.0f,
            .sAcc      = m_last_received_pvt.sAcc,
            .headAcc   = m_last_received_pvt.headAcc / 100000.0f,
            .pDOP      = m_last_received_dop.pDOP / 100.0f,
            .vDOP      = m_last_received_dop.vDOP / 100.0f,
            .hDOP      = m_last_received_dop.hDOP / 100.0f,
            .headVeh   = m_last_received_pvt.headVeh / 100000.0f
        };

        //DEBUG_TRACE("GPS Pos - %02u/%02u/%04u %02u:%02u:%02u lat: %f lon: %f hDOP: %f",
        //            gnss_data.day, gnss_data.month, gnss_data.year,
        //            gnss_data.hour, gnss_data.min, gnss_data.sec,
        //            gnss_data.lat, gnss_data.lon, static_cast<double>(gnss_data.hDOP));

        if (m_data_notification_callback)
            m_data_notification_callback(gnss_data);
    }
}

M8QReceiver::SendReturnCode M8QReceiver::setup_uart_port()
{
    // Disable NMEA and only allow UBX messages

    CFG::PRT::MSG_UART uart_prt = 
    {
        .portID = CFG::PRT::PORTID_UART,
        .reserved1 = 0,
        .txReady = 0,
        .mode = CFG::PRT::MODE_CHARLEN_8BIT | CFG::PRT::MODE_PARITY_NO | CFG::PRT::MODE_STOP_BITS_1,
        .baudRate = 460800,
        .inProtoMask = CFG::PRT::PROTOMASK_UBX,
        .outProtoMask = CFG::PRT::PROTOMASK_UBX,
        .flags = 0,
        .reserved2 = {0}
    };

    //DEBUG_TRACE("GPS CFG-PRT ->");

    auto ret = send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_PRT, uart_prt, false);
    m_nrf_uart_m8->change_baudrate(uart_prt.baudRate);

    nrf_delay_ms(100); // Wait for the port to have changed baudrate

    return ret;
}

M8QReceiver::SendReturnCode M8QReceiver::setup_gnss_channel_sharing()
{
    SendReturnCode ret;

    CFG::GNSS::MSG_GNSS cfg_msg_cfg_gnss =
    {
        .version = 0x00,
        .numTrkChHw = 0,
        .numTrkChUse = 0xFF, // Use max number of tracking channels
        .numConfigBlocks = 7,
        .data =
        {
            {
                .gnssId = CFG::GNSS::GNSSID_GPS,
                .resTrkCh = 8,
                .maxTrkCh = 16,
                .reserved1 = 0,
                .flags = CFG::GNSS::FLAGS_GPS_L1CA | CFG::GNSS::FLAGS_ENABLE
            },
            {
                .gnssId = CFG::GNSS::GNSSID_SBAS,
                .resTrkCh = 1,
                .maxTrkCh = 3,
                .reserved1 = 0,
                .flags = CFG::GNSS::FLAGS_SBAS_L1CA
            },
            {
                .gnssId = CFG::GNSS::GNSSID_GALILEO,
                .resTrkCh = 4,
                .maxTrkCh = 8,
                .reserved1 = 0,
                .flags = CFG::GNSS::FLAGS_GALILEO_E1 | CFG::GNSS::FLAGS_ENABLE
            },
            {
                .gnssId = CFG::GNSS::GNSSID_BEIDOU,
                .resTrkCh = 8,
                .maxTrkCh = 16,
                .reserved1 = 0,
                .flags = CFG::GNSS::FLAGS_BEIDOU_B1I
            },
            {
                .gnssId = CFG::GNSS::GNSSID_IMES,
                .resTrkCh = 0,
                .maxTrkCh = 8,
                .reserved1 = 0,
                .flags = CFG::GNSS::FLAGS_IMES_L1
            },
            {
                .gnssId = CFG::GNSS::GNSSID_QZSS,
                .resTrkCh = 0,
                .maxTrkCh = 3,
                .reserved1 = 0,
                // To avoid cross-correlation issues, it is recommended that GPS and QZSS are always both enabled or both disabled
                .flags = CFG::GNSS::FLAGS_QZSS_L1CA | CFG::GNSS::FLAGS_ENABLE
            },
            {
                .gnssId = CFG::GNSS::GNSSID_GLONASS,
                .resTrkCh = 8,
                .maxTrkCh = 14,
                .reserved1 = 0,
                .flags = CFG::GNSS::FLAGS_GLONASS_L1 | CFG::GNSS::FLAGS_ENABLE
            }
        }
    };

    //DEBUG_TRACE("GPS CFG-GNSS ->");
    ret = send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_GNSS, cfg_msg_cfg_gnss);
    if (ret != SendReturnCode::SUCCESS)
        return ret;

