arribada/CLS-Argos-Linkit-CORE/ports/nrf52840/core/hardware/m8q/m8q.cpp
    // Applying the GNSS system configuration takes some time. After issuing UBX-
    // CFG-GNSS, wait first for the acknowledgement from the receiver and then 0.5
    // seconds before sending the next command
    nrf_delay_ms(500);

    // Save the configuration up until this point into RAM so that it is retained through the CFG-RST hardware reset
    //DEBUG_TRACE("GPS CFG-CFG ->");
    CFG::CFG::MSG_CFG cfg_msg_cfg_cfg =
    {
        .clearMask   = 0,
        .saveMask    = CFG::CFG::CLEARMASK_IOPORT   |
                       CFG::CFG::CLEARMASK_MSGCONF  |
                       CFG::CFG::CLEARMASK_INFMSG   |
                       CFG::CFG::CLEARMASK_NAVCONF  |
                       CFG::CFG::CLEARMASK_RXMCONF  |
                       CFG::CFG::CLEARMASK_SENCONF  |
                       CFG::CFG::CLEARMASK_RINVCONF |
                       CFG::CFG::CLEARMASK_ANTCONF  |
                       CFG::CFG::CLEARMASK_LOGCONF  |
                       CFG::CFG::CLEARMASK_FTSCONF,
        .loadMask    = 0,
        .deviceMask  = CFG::CFG::DEVMASK_BBR,
    };

    ret = send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_CFG, cfg_msg_cfg_cfg);
    if (ret != SendReturnCode::SUCCESS)
        return ret;

    // If Galileo is enabled, UBX-CFG-GNSS must be followed by UBX-CFG-RST with resetMode set to Hardware reset
    //DEBUG_TRACE("GPS CFG-RST ->");
    CFG::RST::MSG_RST cfg_msg_cfg_rst =
    {
        .navBbrMask = 0x0000,
        .resetMode = CFG::RST::RESETMODE_HARDWARE_RESET_IMMEDIATE,
        .reserved1 = 0,
    };

    ret = send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_RST, cfg_msg_cfg_rst, false); // No acknowledge from this message

    // Wait for the device to have reset
    nrf_delay_ms(100); // This is an estimated value

    return ret;
}

M8QReceiver::SendReturnCode M8QReceiver::setup_power_management()
{
    CFG::PM2::MSG_PM2 cfg_msg_cfg_pm2 =
    {
        .version = 0x02,
        .reserved1 = 0,
        .maxStartupStateDur = 0,
        .reserved2 = 0,
        .flags = CFG::PM2::FLAGS_DONOTENTEROFF | CFG::PM2::FLAGS_UPDATEEPH | CFG::PM2::FLAGS_MODE_CYCLIC | CFG::PM2::FLAGS_LIMITPEAKCURR_DISABLED,
        .updatePeriod = 1000,
        .searchPeriod = 10000,
        .gridOffset = 0,
        .onTime = 0,
        .minAcqTime = 300,
        .reserved3 = {0},
        .extintInactivityMs = 0
    };

    //DEBUG_TRACE("GPS CFG-PM2 ->");

    return send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_PM2, cfg_msg_cfg_pm2);
}

M8QReceiver::SendReturnCode M8QReceiver::setup_lower_power_mode()
{
    CFG::RXM::MSG_RXM cfg_msg_cfg_rxm =
    {
        .reserved1 = 0,
        .lpMode = CFG::RXM::CONTINUOUS_MODE
    };

    //DEBUG_TRACE("GPS CFG-RXM ->");

    return send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_RXM, cfg_msg_cfg_rxm);
}

M8QReceiver::SendReturnCode M8QReceiver::setup_simple_navigation_settings(const GPSNavSettings& nav_settings)
{
    CFG::NAV5::MSG_NAV5 cfg_msg_cfg_nav5 =
    {
        .mask = CFG::NAV5::MASK_DYN | CFG::NAV5::MASK_MIN_EL | CFG::NAV5::MASK_POS_FIX_MODE | CFG::NAV5::MASK_POS_MASK | CFG::NAV5::MASK_TIME_MASK | CFG::NAV5::MASK_STATIC_HOLD_MASK | CFG::NAV5::MASK_DGPS_MASK | CFG::NAV5::MASK_CNO_THRESHOLD | CFG::NAV5::MASK_UTC,
        .dynModel = (CFG::NAV5::DynModel)nav_settings.dyn_model,
        .fixMode = (CFG::NAV5::FixMode)nav_settings.fix_mode,
        .fixedAlt = 0,
        .fixedAltVar = 10000,
        .minElev = 5,
        .drLimit = 0,
        .pDop = 250,
        .tDop = 250,
        .pAcc = 100,
        .tAcc = 350,
        .staticHoldThresh = 0,
        .dgnssTimeOut = 60,
        .cnoThreshNumSVs = 0,
        .cnoThresh = 0,
        .reserved1 = {0},
        .staticHoldMaxDist = 0,
        .utcStandard = 0,
        .reserved2 = {0}
    };

    //DEBUG_TRACE("GPS CFG-NAV5 ->");

    return send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_NAV5, cfg_msg_cfg_nav5);
}

M8QReceiver::SendReturnCode M8QReceiver::setup_expert_navigation_settings()
{
    CFG::NAVX5::MSG_NAVX5 cfg_msg_cfg_navx5 =
    {
        .version = 0x0002,
        .mask1 = CFG::NAVX5::MASK1_MIN_MAX | CFG::NAVX5::MASK1_MIN_CNO | CFG::NAVX5::MASK1_INITIAL_3D_FIX | CFG::NAVX5::MASK1_WKN_ROLL | CFG::NAVX5::MASK1_ACK_AID | CFG::NAVX5::MASK1_PPP | CFG::NAVX5::MASK1_AOP,
        .mask2 = 0,
        .reserved1 = {0},
        .minSVs = 3,
        .maxSVs = 32,
        .minCNO = 6,
        .reserved2 = 0,
        .iniFix3D = 0,
        .reserved3 = {0},
        .ackAiding = 1,
        .wknRollover = 0, // Use firmware default
        .sigAttenCompMode = 0,
        .reserved4 = 0,
        .reserved5 = {0},
        .reserved6 = {0},
        .usePPP = 0,
        .aopCfg = CFG::NAVX5::AOPCFG_AOP_ENABLED,
        .reserved7 = {0},
        .aopOrbMaxErr = 100,
        .reserved8 = {0},
        .reserved9 = {0},
        .useAdr = 0
    };

    //DEBUG_TRACE("GPS CFG-NAVX5 ->");

    return send_packet_contents(MessageClass::MSG_CLASS_CFG, CFG::ID_NAVX5, cfg_msg_cfg_navx5);
}

M8QReceiver::SendReturnCode M8QReceiver::supply_time_assistance()
{
    if (!rtc->is_set())
    {
        DEBUG_TRACE("M8QReceiver::supply_time_assistance: no time to send");
        return SendReturnCode::SUCCESS;
    }

    uint16_t year;
    uint8_t month, day, hour, min, sec;

    convert_datetime_to_epoch(rtc->gettime(), year, month, day, hour, min, sec);

    MGA::MSG_INI_TIME_UTC cfg_msg_ini_time_utc =
    {
        .type = 0x10,
        .version = 0x00,
        .ref = 0x00,
        .leapSecs = -128, // Number of leap seconds unknown
        .year = year,
        .month = month,
        .day = day,
        .hour = hour,
        .minute = min,
        .second = sec,
        .reserved1 = 0,
        .ns = 0,
        .tAccS = 2, // Accurate to within 2 seconds, perhaps this can be improved?
        .reserved2 = {0},
        .tAccNs = 0
    };

    //DEBUG_TRACE("GPS MGA-INI-TIME-UTC ->");

    // This message expects a MGA-ACK as opposed to a ACK-ACK so we can't use this function for testing the response
    SendReturnCode ret = send_packet_contents(MessageClass::MSG_CLASS_MGA, MGA::ID_INI_TIME_UTC, cfg_msg_ini_time_utc, false);
    if (ret != SendReturnCode::SUCCESS)
        return ret;

    // Instead we shall do so manually (Note: this will only work if ackAiding has been set in NAVX5)
    auto start_time = rtc->gettime();
    const std::time_t timeout = 3;
    for (;;)
    {
        if (m_rx_buffer.pending)
        {
            UBX::Header *header_ptr = reinterpret_cast<UBX::Header *>(&m_rx_buffer.data[0]);
            if (header_ptr->msgClass == UBX::MessageClass::MSG_CLASS_MGA && header_ptr->msgId == UBX::MGA::ID_ACK)
            {
                UBX::MGA::MSG_ACK *msg_ack_ptr = reinterpret_cast<UBX::MGA::MSG_ACK *>(&m_rx_buffer.data[sizeof(UBX::Header)]);
                if (msg_ack_ptr->msgId == MGA::ID_INI_TIME_UTC)
                {
                    //DEBUG_TRACE("GPS MGA-ACK <- infoCode: %u", msg_ack_ptr->infoCode);
                    return SendReturnCode::SUCCESS;
                }
            }

            m_rx_buffer.pending = false;
        }

        if (rtc->gettime() - start_time >= timeout)
        {
            DEBUG_ERROR("M8QReceiver::send_navigation_database: timed out waiting for response");
            m_navigation_database_len = 0; // Invalidate the data we did receive
            return SendReturnCode::RESPONSE_TIMEOUT;
        }
    }

    return SendReturnCode::SUCCESS;
}

M8QReceiver::SendReturnCode M8QReceiver::disable_odometer()
{
    CFG::ODO::MSG_ODO cfg_msg_cfg_odo =
    {
        .version = 0x00,
        .reserved1 = {0},
        .flags = 0,
        .odoCfg = 0,
        .reserved2 = {0},
        .cogMaxSpeed = 1,
        .cogMaxPosAcc = 50,
        .reserved3 = {0},
        .velLpGain = 153,
        .cogLpGain = 76,
        .reserved4 = {0}
    };

